// Sample music data for different moods
export const moodMusic = {
    happy: [
        { 
            title: "Here With Me", 
            artist: "d4vd", 
            duration: "4:02", 
            file: "songs/Here With Me.mp3",
            novel: `唐探1900 (2025)【4K / HQ / 60FPS / 高码率】【27.3G】:
https://pan.quark.cn/s/f77c59dffe89

我的世界大电影  (2025)【4K 高码率 WEB-DL】【杜比视界 & 杜比全景声】内封简繁简英双语字幕[17.6G]
https://pan.quark.cn/s/68c04fb1888e

华尔街之狼 (2013) 4K HDR 原盘未删减 内封简英简繁字幕
https://pan.quark.cn/s/ececfd32103e
`,
gifs: ["images/55.jpg", "images/66.jpg", "images/77.jpg"]
        },
        {
            title: "Confident",
            artist: "justin bieber",
            duration: "4:08",
            file: "songs/Confident.mp3",
            novel: ``,
            gifs: ["images/chain/11.jpg", "images/chain/22.jpg", "images/chain/99.jpg", "images/chain/7.jpg", "images/chain/chain2.jpg", "images/chain/chain1.jpg","images/chain/chain3.jpg", "images/chain/chain4.jpg", "images/chain/chain5.jpg", "images/chain/chain6.jpg","images/chain/chain7.jpg","images/chain/chain8.jpg"]
        }
        
    ],
    sad: [
        {
            title: "Soul Below",
            artist: "Ljones",
            duration: "3:15",
            file: "songs/Soul Below.mp3",
            novel: `Call you on the phone, I'd hate to leave you on your own

第一章 回归（1）

太阳落山，月亮消失在黑暗中，只剩下漆黑的天空，山上遍布着无数的尸体。

脚步，脚步。

一个年轻人走在尸山之间，摇摇欲坠。

死亡。

满目疮痍，碎尸万段，内脏散落，脑浆四溅。

呜呜呜！

就在这时，一道星光洒落在他身上，照亮了黑暗。

“干得好，觉醒者李信赫。”

一个银发及腰的女子缓缓从天而降，星光织就的长裙在空中飘扬。

浑身是血的年轻人向着女子——不，是女神——呼喊道。

“……维迦。”

织女星，天琴座的女神，冷冷地俯视着他。在点亮夜空的众多星座中，她是最璀璨的天神。

“你杀了天魔，拯救了这个世界。”

她语无伦次，仿佛在读纸上的字。

“……拯救了？”

李信赫嘴角勾起一抹笑意。随后，他放声大笑，肩膀都颤抖起来。

“咯咯咯。你刚才说我拯救了这个世界？”

咚！

他猛地一跺脚，嘶哑地咆哮道：“少胡扯！”

泪水顺着他的脸颊滚落。

“我没有拯救这个世界！大家都死在了那个怪物的手里！我没能保护好他们！”

他倒在地上，发出一声痛苦的惨叫。

咚。

“十二星座的使徒们！七星们！就连那些该死的天族们！”

数万觉醒者齐心协力。就连那些日日争斗的天族们，也为了杀死被称为天魔的怪物而联手，然而……

“全、全员……最终都被吞噬了……”

他无奈地低下头。

脑海中不断浮现出怪物撕裂大军，独自吞噬天族的画面。

“即便如此，你最终还是斩杀了天魔。”

温柔的使徒们，勇敢的战士们，高尚的天族们，以及无数其他人，在战斗中牺牲了。

“觉醒者李信赫，你杀死了天魔。”

李信赫抬起头，茫然地看着倒地的天魔，他的心脏已被长矛刺穿。一双毫无生气的蓝眼睛从遮住他脸的白色面具后窥视着。

李信赫紧张地咽了口唾沫，然后喊出了怪物的名字。

“……天魔权五镇。”

天空之魔，黑色天堂之主，凶猛的掠食者。虽然他有很多名字，但他只控制着一种情绪。

恐惧。

压倒性的，绝对的恐惧。“天魔”这个名字本身就让整个世界感到恐惧。

然而，情况并非一直如此。过去，权五镇和李信赫一样，也只是一个觉醒者，甚至可能更弱。

然而，权五镇唤醒了黑色天堂，一种可以吸收天神赋予觉醒者圣痕的力量。他运用新获得的能力，吞噬了数量惊人的圣痕，最终甚至吞噬了拥有这些圣痕的天神，他们的尸体覆盖了整座山丘。

这颗名为地球的星球的末日已经到来。

女神再次开口，低沉的声音将他拉回了意识。

“觉醒者李信赫，你已斩杀天魔，拯救了这个世界。遵照星之誓言，我将满足你一个愿望。”

李信赫冰冷的双眼开始燃烧，干燥的嘴唇勉强张开。

“送我……回到过去。”

维加瞪大了眼睛。

“什么？你想倒退？”

“没错。”

“你真的想重新经历那段可怕的过去吗？”

李信赫咬紧牙关。

“这次不一样。”

他会不惜一切代价来扭转局面。

“嗯。”

女神眯着眼看着他。

“原来你想成为逆天星啊。”

女神面前的人类，实际上是在要求成为逆天者，唯一能够逆天改命，改写早已注定结局的故事的存在。

“世界的命运难以改变。”

“我知道。”

“你的未来或许会比这更加痛苦和绝望。”

“我会改变你的命运。”

“不会再有第二次机会了。”

“我只需要一次。”

李信赫的眼中燃烧着坚定的决心。

“……”

女神闭上了那双仿佛映照着星辰的金色眼睛。沉思片刻后，她回头看着李信赫。

“好的。遵照星之誓言，我会把你送回过去。”

李信赫紧紧握拳。

“还有一件事。”

“星之誓言只能实现一个愿望。”

“这不是愿望。我有个建议，维迦。给我天琴座的圣痕。”

女神金色的眼眸闪烁了一下。

“你知道的，对吧？人类无法承受我的圣痕。”

正如她所说，由于天琴座的力量太强大，人类根本无法承受天琴座的圣痕，更别说使用它了。就连天魔也无法承受。
        `
        },
        {
            title: "跳楼机",
            artist: "利比",
            duration: "3:30",
            file: "songs/跳楼机.mp3",
            novel: `风走了 只留下一条街的叶落 你走了 只留下我双眼的红

第二章 骗子（一）

逆天星？回归者？

她在说什么？

回归者……就是从未来回来的人？

如果她指的是这个，那她就大错特错了。

他并非来自未来，甚至不确定自己能否活到明天。不，明天还有什么必要考虑？照这样下去，不到五分钟，他就会被周围的怪物撕成碎片。

别慌。

作为一个非觉醒者，他必须比任何人都更快地思考、理解和做出决定，才能在这个可怕的世界中生存下去。

咽了口唾沫。

他紧张地咽了口唾沫，开始思考自己首先要做什么。

我得弄清楚到底发生了什么。

权五镇盯着李信赫被烧得焦黑的尸体。

他回想起几个小时前第一次见到李信赫的情景。

***

“好了，今天去找个好欺负的。”

一个寻常的下午，权五镇伸了伸酸痛的身子，撑起身子。他环顾四周，朝着一道新手觉醒者们常去的大门走去。

“哇哦。”

许多觉醒者站在大门周围，寻找着可以加入的队伍。其中，有一个人特别吸引了他的目光。

他真是完美。

他穿着护腿和皮甲，上面装饰着一些毫无用处的装饰品。他手里拿着一把两米长的长枪，枪刃上泛着淡淡的蓝光，显得相当昂贵。

权五镇悠闲地走向一个年轻人，他似乎坚称自己并非周围那些新手觉醒者。

我做这种破事都八年了吗？

八年前，权五镇离开了地狱般的孤儿院，开始找工作维持生计。然而，仿佛上天跟他开了个残酷的玩笑，整个世界变成了他的新地狱。

这个世界真是糟透了。

北极出现第一道裂缝后，通往异世界的大门如同决堤的堤坝般遍布星球。怪物从大门涌出，席卷了人类。

幸运的是，就在怪物征服了超过半个星球的时候，被称为天神的超凡存在出现了。他们赋予人类圣痕，赋予他们与怪物战斗的力量。于是，星辰觉醒者——通常被称为觉醒者的超人——诞生了。

但我从未成为觉醒者。

在一个充满无尽混乱和苦难的世界里，一个尚未成为觉醒者的孤儿，生存的方式寥寥无几。

尽管如此，他还是活了下来——即使这意味着要像水蛭一样吸食他人血液。

“我的天哪！你显然不属于这种地方！”

“你是……？”

“我叫权五镇，水瓶座的一星使徒。”

“水、水瓶座？！”

年轻人瞪大了眼睛。

他的惊讶并非杞人忧天。水瓶座是黄道十二宫之一，在数百个星座中，地位最高。

“真不敢相信你是黄道十二宫的使徒……我从未见过。”

“不过，我还只是一星，”权五镇友好地笑着说。“哦，那你是……？”

“啊！我是李信赫，皮克西斯的二星使徒。”

“皮克西斯的使徒！”权五镇欢呼起来，无缘无故地鼓起了掌。“太棒了！圣痕可以掌控所有方向！听说皮克西斯的觉醒者可以像使用自己的四肢一样，操控最难的武器。”

“哈哈，我没那么厉害。跟十二生肖的圣痕比起来，简直不值一提。”

李信赫装作若无其事，但权五镇看到他嘴角上扬。

我真是看人眼光真好。

看到李信赫的反应和他预想的完全一致，他不禁咧嘴一笑。

既然已经选定了猎物，就该开始行动了。

“哈哈！看来是缘分让我们相遇了。不如一起组队？”

“组队……？”

李信赫一脸疑惑。他没想到一个与十二生肖相关的觉醒者竟然会主动提出组队。

“我很乐意，但是真吾……”

权五真只是把自己的名字倒过来念，就想出了假名真吾。虽然有些人可能会觉得这伪装很不牢固，但正是这种假名才更难被识破。

一直就在你眼皮底下的东西，更难被发现。

在诈骗的时候，谁会想到用一个像真名倒过来念这样拙劣的假名呢？

我得在不被发现的情况下，尽可能多地从他那里得到好处。

大多数受害者甚至都没意识到他在骗他们。

对觉醒者来说，他就像蚊子一样。他极其虚弱，如果被发现吸血，很容易被杀死。

我得找个借口了。

李信赫一脸疑惑地看着他。

“嗯……我不想说出来，但说实话，我不太擅长运用圣痕的力量，”权五镇说。`
        }, 
        {
            title: "唯唯",
            artist: "asen",
            duration: "3:13",
            file: "songs/唯唯.mp3",
            novel: `
            
第三章 骗子（二）

“哈！”

这叫安慰剂效应吗？

李信赫仿佛真的获得了增益，迅速冲向怪物。

“呼呼！”

从灌木丛中钻出一只蚁刺，一只一星怪物，外形像蚂蚁和狼的混合体。它是低级门派中最常见的怪物，虽然它更像狼，但身上覆盖着坚硬的甲壳，而不是柔软的皮毛。

“哈！”

他像水流一样挥舞长矛，锋利地刺穿了蚁刺坚硬的外壳。

咔嚓！

“呼呼！”

蚁刺试图咬住李信赫。然而，他仿佛早有预料，轻松躲开了。

“哈哈！我感觉轻松多了！”李信赫一边对付着安特隆，一边惊呼道。

很高兴你喜欢我的假BUFF。

权五镇忍不住笑了出来。他一看到李信赫就知道他很容易被利用，但这完全出乎他的意料。

太棒了！

想到自己抓住了一个完美的软柿子，他兴奋不已。

咔嚓！

“呼……！”

安特隆一声叫出，被斩首了。

“呼。”

“干得好。”

“哈哈，这都是你的BUFF的功劳，镇五。”

“不，就算没有我的BUFF，你也能轻松干掉那怪物。”

权五镇没撒谎。毕竟，他一开始就没有给他施加BUFF。

他还不错。

权五镇知道，不能因为李信赫轻而易举地解决了一个弱小的一星怪物就妄下结论。尽管如此，他的战斗力比权五镇过去遇到的大多数觉醒者都要强。

李信赫是一位技艺高超的战士——不，他是一位技艺高超、容易被轻易战胜的对手。

太好了。

这种级别的人很少见。

“那么，星石的采集呢……”

“哦，我来处理。”

“但是——”

“我不太擅长正面战斗，所以交给我吧。你先休息一下，信赫。”

“谢谢。”

李信赫鞠躬坐下。

权五镇轻声笑了笑，在被斩首的安索恩尸体里翻找起来。没过多久，他发现了一块指甲盖大小的蓝光石。

星石。

星石据说蕴含着星辰之力，能够吸收一部分圣痕的力量，因此价值不菲，是觉醒者的主要收入来源。

不过，这块不值钱。

一星怪物的星石体积小，品质低，所以价格不菲。

这块应该能赚到两万韩元左右。

平分的话，每块大概一万韩元。考虑到战斗不到一分钟，这份报酬还算不错。

如果运气好的话，今天能赚到三十万韩元左右。

考虑到每次骗人都要冒着生命危险，这点报酬显然不够，但也没办法。在这个乱世里，一个既无权势又无关系的普通人，一天能赚这么多，已经很了不起了。

“厉害啊……”

权五镇茫然地看着手中的星石。

没错。像他这样只会说空话的人，能赚这么多钱，确实很了不起。然而，要买到真正想要的东西，达到心中的目标，他需要的钱远不止这些。

“五？”

“啊。”

李信赫的声音把权五镇拉回了现实，权五镇转过身来面对他。

李信赫正一脸疑惑地看着他。

“有什么事吗？”

权五镇摇摇头，走到他身边。“没，没什么。”

“那我们继续吧。”

确认了李信赫的实力后，是时候深入森林了。

***

“呼呼！”

“呼呼！”

“嘎——！”

三头蚁刺巨兽包围了李信赫。其中有一头老蚁刺巨兽——一头二星巨兽。

“哼！”

李信赫滑过地面，毫不犹豫地斩杀了蚁刺巨兽群。他迅速斩下两头体型较小的蚁刺巨兽的头颅，然后迎战体型更大的老蚁刺巨兽。

“湖之祝福！”

李信赫正酣战，权五镇身后玻璃粉飞溅，蓝色的尘埃随风飘散，直冲李信赫身旁。

李信赫大喝一声，一脚跺在地上。“哈——！”

咔嚓！

“嘎——！喀——！”

李信赫双手握枪，高高跃起。然后他像流星一样坠落，长矛刺入了长老安索恩的头颅。怪物发出了最后一声尖叫，倒了下去。

李信赫气喘吁吁地倒在地上。“呼，呼。”

四个小时的激烈狩猎。虽然觉醒者拥有惊人的耐力，但这两个人已经够累的了。

权五镇也明显筋疲力尽，他重重地吐了口气。“呼……你还好吗？”

他只是在一旁看着，其实并不累。然而，为了避免引起怀疑，他需要装作疲惫的样子。

李信赫喘了口气，点了点头。“我没事。”

是时候结束这一切了。

找到合适的妈妈`
        }
    ],
    tired: [
       
        {
            title: "瞬V2.",
            artist: "郑润泽",
            duration: "5:55",
            file: "songs/瞬V2.mp3",
            novel: ``,
            gifs: ["images/1.gif", "images/2.gif", "images/3.gif"]
        }
        , 
        {
            title: "We Don't Talk Anymore",
            artist: "dj",
            duration: "3:45",
            file: "songs/We Don't Talk Anymore.mp3",
            novel: ``,
            gifs: ["images/gifmeme/4.gif","images/gifmeme/5.gif","images/gifmeme/6.gif","images/gifmeme/2.gif","images/gifmeme/3.gif","images/gifmeme/2.gif","images/gifmeme/a2.gif","images/gifmeme/a1.gif"]

        }
        
    ],
    stressed: [
        {
            title: "YOSEMITE.Explicit.",
            artist: "Travis Scott",
            duration: "2:30",
            file: "songs/YOSEMITE.Explicit..mp3",
            novel: `so gang,heh?`,
            gifs: ["images/gang/w.jpg", "images/gang/c.jpg", "images/gang/cash.jpg"]
        },
        
        {
            title: "7 Years",
            artist: "Lukas Graham",
            duration: "3:50",
            file: "songs/7 Years.mp3",
            novel: `“时间本质上是心灵创造的一种幻觉，帮助我们感知浩瀚宇宙中时间的存在。如果没有神经元基于我们所有的经历创造对过去和未来的虚拟感知，过去和未来就不存在。所有存在的，都是现在。”
——阿比吉特·纳斯卡，《爱、上帝与神经元：一位因迷失而发现自己的科学家的回忆录》
― Abhijit Naskar, Love, God & Neurons: Memoir of a scientist who found himself by getting lost

“时间像雨一样落在我们身上，像雨一样落下，直到我们被淹没，有时，就像排水沟溢出，时间就——积聚，渗入，聚集在角落里。”
― Michael Montoure, Slices

我们以断断续续的作者身份书写着个人故事；叙述者始终在寻找一个统一的视角。我们努力从统一的视角感知自我，但这几乎不可能。人类对自我的感知是一种幻觉。我们不断地筛选着变幻的记忆。我们在过去散发的芬芳和未来的虚幻氛围中体验着当下。
― Kilroy J. Oldster, Dead Toad Scrolls`


        }
    ]
}; 